#+SETUPFILE: ~/.vault/cfgs/org-central/org-setupfile
#+TITLE: notes on Genesis // Packer

** info, Packer w/ DigitalOcean
:PROPERTIES:
:ID: 56A054E3-6688-4551-8220-CB46B914EA43
:END:
:LOGBOOK:
:END:

 - context ::
   - [0/0] overview
     - enables scripted creation of DO snapshot (convertable to live VM) using Packer
   - info/notes
     - srcs
       #+NAME: 56A054E3-6688-4551-8220-CB46B914EA43-srcs
       #+CAPTION: reference list
       | ! | title | url                                                                                                                                   | desc | rowid   |
       |   | title | url                                                                                                                                   | desc | rowid   |
       |---+-------+---------------------------------------------------------------------------------------------------------------------------------------+------+---------|
       | / |       |                                                                                                                                       |      | <7>     |
       | # |       | https://www.digitalocean.com/community/tutorials/automated-provisioning-of-digitalocean-cloud-servers-with-salt-cloud-on-ubuntu-12-04 |      | <<BD018EFB-4794-491F-8DB1-4F3D26A4B1F8>> |
       #+TBLFM: $5='(if (and (string= @1$rowid "rowid") (string= $rowid "")) (concat "<<"(org-id-new) ">>") $rowid)
     - on Initial Understanding a/o Discovery
   - Questions
   - log
 - procedure :: fix, EM:"unable to handshake" during image provisioning
   - nb,
     - try changing or even removing the =ssh_username= parameter, (https://github.com/mitchellh/packer/issues/788)
 - procedure :: howto, get list of available "distribution" images
   - (ex.) HTTP Request to list available DigitalOcean Images
     #+CAPTION: HTTP Request to list available DigitalOcean Images
     #+NAME: 3392EAA1-ACD5-47BC-B9C0-27DEB6BE629B
     #+BEGIN_SRC http :pretty json :var DO_TOKEN="your-personal-access-token-here"
     GET https://api.digitalocean.com/v2/images?type=distribution
     Authorization: Bearer ${DO_TOKEN}
     #+END_SRC

     #+RESULTS[3326feaa53656328c15fc7e06a94d554c90d4aa3]: 3392EAA1-ACD5-47BC-B9C0-27DEB6BE629B
     #+begin_example
     {
       "images": [
         {
           "id": 16469590,
           "name": "991.2.0 (beta)",
           "distribution": "CoreOS",
           "slug": "coreos-beta",
           "public": true,
           "regions": [
             "nyc1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2016-03-26T18:36:29Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 6372321,
           "name": "5.10 x64",
           "distribution": "CentOS",
           "slug": "centos-5-8-x64",
           "public": true,
           "regions": [
             "nyc1",
             "ams1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2014-09-26T16:40:18Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 6372425,
           "name": "5.10 x32",
           "distribution": "CentOS",
           "slug": "centos-5-8-x32",
           "public": true,
           "regions": [
             "nyc1",
             "ams1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2014-09-26T16:45:29Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 10144573,
           "name": "10.1",
           "distribution": "FreeBSD",
           "slug": "freebsd-10-1-x64",
           "public": true,
           "regions": [
             "nyc1",
             "ams1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2015-01-20T20:04:34Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 12065782,
           "name": "22 x64",
           "distribution": "Fedora",
           "slug": "fedora-22-x64",
           "public": true,
           "regions": [
             "nyc1",
             "ams1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2015-05-28T19:54:54Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 13321858,
           "name": "10.2",
           "distribution": "FreeBSD",
           "slug": "freebsd-10-2-x64",
           "public": true,
           "regions": [
             "nyc1",
             "ams1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2015-08-28T19:14:36Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 14238961,
           "name": "23 x64",
           "distribution": "Fedora",
           "slug": "fedora-23-x64",
           "public": true,
           "regions": [
             "nyc1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2015-11-03T17:35:54Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 14782899,
           "name": "6.7 x32",
           "distribution": "CentOS",
           "slug": "centos-6-5-x32",
           "public": true,
           "regions": [
             "nyc1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2015-12-10T17:10:48Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 14782952,
           "name": "6.7 x64",
           "distribution": "CentOS",
           "slug": "centos-6-5-x64",
           "public": true,
           "regions": [
             "nyc1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2015-12-10T17:19:06Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 15611095,
           "name": "8.3 x64",
           "distribution": "Debian",
           "slug": "debian-8-x64",
           "public": true,
           "regions": [
             "nyc1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2016-02-03T01:46:48Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 15621569,
           "name": "8.3 x32",
           "distribution": "Debian",
           "slug": "debian-8-x32",
           "public": true,
           "regions": [
             "nyc1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2016-02-03T14:48:27Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 15621816,
           "name": "15.10 x64",
           "distribution": "Ubuntu",
           "slug": "ubuntu-15-10-x64",
           "public": true,
           "regions": [
             "nyc1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2016-02-03T16:06:21Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 15621817,
           "name": "15.10 x32",
           "distribution": "Ubuntu",
           "slug": "ubuntu-15-10-x32",
           "public": true,
           "regions": [
             "nyc1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2016-02-03T16:06:25Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 15943196,
           "name": "12.04.5 x32",
           "distribution": "Ubuntu",
           "slug": "ubuntu-12-04-x32",
           "public": true,
           "regions": [
             "nyc1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2016-02-23T22:11:53Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 15943270,
           "name": "12.04.5 x64",
           "distribution": "Ubuntu",
           "slug": "ubuntu-12-04-x64",
           "public": true,
           "regions": [
             "nyc1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2016-02-23T22:19:12Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 15943510,
           "name": "14.04.4 x32",
           "distribution": "Ubuntu",
           "slug": "ubuntu-14-04-x32",
           "public": true,
           "regions": [
             "nyc1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2016-02-23T22:44:58Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 15943679,
           "name": "14.04.4 x64",
           "distribution": "Ubuntu",
           "slug": "ubuntu-14-04-x64",
           "public": true,
           "regions": [
             "nyc1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2016-02-23T23:01:40Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 16040476,
           "name": "7.2 x64",
           "distribution": "CentOS",
           "slug": "centos-7-0-x64",
           "public": true,
           "regions": [
             "nyc1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2016-02-29T21:17:07Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 16623283,
           "name": "7.10 x32",
           "distribution": "Debian",
           "slug": "debian-7-0-x32",
           "public": true,
           "regions": [
             "nyc1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2016-04-04T18:11:05Z",
           "min_disk_size": 20,
           "type": "snapshot"
         },
         {
           "id": 16623308,
           "name": "7.10 x64",
           "distribution": "Debian",
           "slug": "debian-7-0-x64",
           "public": true,
           "regions": [
             "nyc1",
             "sfo1",
             "nyc2",
             "ams2",
             "sgp1",
             "lon1",
             "nyc3",
             "ams3",
             "fra1",
             "tor1"
           ],
           "created_at": "2016-04-04T18:18:11Z",
           "min_disk_size": 20,
           "type": "snapshot"
         }
       ],
       "links": {
         "pages": {
           "last": "https://api.digitalocean.com/v2/images?page=2&type=distribution",
           "next": "https://api.digitalocean.com/v2/images?page=2&type=distribution"
         }
       },
       "meta": {
         "total": 22
       }
     }
#+end_example
